# ParameterId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormulaEditingEventArgs..::..ParameterId Property
FormulaEditingEventArgs Class See Also
---
Returns the Id of the modified parameter
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId ParameterId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ParameterId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ParameterId {
	ElementId^ get ();
}
```

# See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace